Wiznet/esp_wiz_toe/examples/udp/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# 1 ms tick: the TOE poll loops (wiztoe_recvfrom) yield in 1 ms steps and count
# those steps for SO_RCVTIMEO/SO_SNDTIMEO. At the IDF default of 100 Hz a 1 ms
# delay truncates to 0 ticks, which busy-waits and starves the idle task.
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
# --- wsm_driver shared settings ---
CONFIG_WSM_DRIVER_ENABLED=y
# Board = ESP32-W5500-Dev-kit, the component Kconfig default. The board fixes
# both the chip and the SPI pins; pick another one in menuconfig:
#   Component config -> WIZnet WSM Driver -> Board
CONFIG_WSM_DRIVER_BACKEND_TOE=y
# pins/clock come from the board selected above. Those symbols have no prompt
# unless the board is Custom, so they CANNOT be overridden from here or from
# sdkconfig -- kconfgen always regenerates them from their `default`. To rewire,
# pick Board -> Custom, or edit the SPI wiring block in the component Kconfig.
